recip/network/messages/upnp/AddPortMapping.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
	<s:Body>
		<u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1">
			<NewRemoteHost></NewRemoteHost>
			<NewExternalPort>%d</NewExternalPort>
			<NewProtocol>TCP</NewProtocol>
			<NewInternalPort>%d</NewInternalPort>
			<NewInternalClient>%s</NewInternalClient>
			<NewEnabled>1</NewEnabled>
			<NewPortMappingDescription>%s</NewPortMappingDescription>
			<NewLeaseDuration>0</NewLeaseDuration>
		</u:AddPortMapping>
	</s:Body>
</s:Envelope>